# Домашняя работа


1. Читаем материал лекции;

2. Читаем информационные ресурсы:
 * [Введение в Java](http://pr0java.blogspot.com/2015/02/java.html)

3. Смотрим информационные ресурсы:
  * [Введение в Java](https://www.youtube.com/watch?v=ZdT_BXPFQh4)

4. Напишите программу TenHelloWorlds.java, которая выведет "Hello, World" в консоли 10 раз.

5. Напишите программу Initials.java, которая печатает в консоль
    ваши инициалы использую 9 строк и звездочки. Например:

```
**        ***    **********      **             *             **
**      ***      **        **     **           ***           **
**    ***        **         **     **         ** **         **  
**  ***          **          **     **       **   **       **   
*****            **          **      **     **     **     **    
**  ***          **          **       **   **       **   **     
**    ***        **         **         ** **         ** **      
**      ***      **        **           ***           ***       
**        ***    **********              *             *        
```

6. Опишите что случится (переведите на русский язык текст сообщения об ошибке,
   в котором объясняется, почему произошла ошибка) если в HelloWorld.java вы пропустите:

   a) main

   b) String

   c) HelloWorld

   d) System.out (без точки)

   e) System.out. (c точкой)

   f) println (без точки)

   g) .println (c точкой)

7. Опишите что случится (переведите на русский язык текст сообщения об ошибке,
   в котором объясняется, почему произошла ошибка) если в HelloWorld.java вы пропустите:

   a) точку с запятой ;

   b) первую двойную кавычку "

   с) вторую двойную кавычку "

   d) первую открывающуюся фигурную скобку {

   e) вторую открывающуюся фигурную скобку {

   f) первую закрывающуюся фигурную скобку }

   g) вторую закрывающуюся фигурную скобку }

8. Наберите следующую программу и сохраните ее в файле Hello.java
   Программа компилируется успешно, но при запуске получаем ошибку
   java.lang.NoSuchMethodError: main.
   Какую ошибку мы допустили?
```
   public class Hello {
      public static void main() {
         System.out.println("Doesn't execute");
      }
   }
```
