# Практическая работа


1. Напишите программу TenHelloWorlds.java, которая выведет "Hello, World" в консоли 10 раз.

2. Опишите что случится (переведите на русский язык текст сообщения об ошибке,
   в котором объясняется, почему произошла ошибка) если в HelloWorld.java вы пропустите:

   a) main

   b) String

   c) HelloWorld

   d) System.out (без точки)

   e) System.out. (c точкой)

   f) println (без точки)

   g) .println (c точкой)

3. Опишите что случится (переведите на русский язык текст сообщения об ошибке,
   в котором объясняется, почему произошла ошибка) если в HelloWorld.java вы пропустите:

   a) точку с запятой ;

   b) первую двойную кавычку "

   с) вторую двойную кавычку "

   d) первую открывающуюся фигурную скобку {

   e) вторую открывающуюся фигурную скобку {

   f) первую закрывающуюся фигурную скобку }

   g) вторую закрывающуюся фигурную скобку }

4. Наберите следующую программу и сохраните ее в файле Hello.java
   Программа компилируется успешно, но при запуске получаем ошибку
   java.lang.NoSuchMethodError: main.
   Какую ошибку мы допустили?
```
   public class Hello {
      public static void main() {
         System.out.println("Doesn't execute");
      }
   }
```

5. Создайте три класса: Car в пакете com.company.vehicles, 
   Engine в пакете com.company.details и 
   Driver в пакете com.company.professions. 
   Все три класса находятся в разных пакетах. 
   В main() методе класса Car создайте объекты класса Engine и Driver. 
   При запуске Car программа должна выводить на консоль "I'm driving!". 
   Скомпилируйте и запустите программу.

   Подсказка: для создания объекта класса используется оператор new, например,
   для создания экземпляра Engine необходимо написать
```
   Engine engine = new Engine();
```

6. Перенесите com.company.professions пакет в отдельный проект. 
   Соберите com.company.professions пакет в JAR-файл и скопируйте в каталог lib. 
   При компиляции и запуске класса Car указывайте JAR-файл в -cp.
